{
  "has_more_items": true, 
  "items": [
    {
      "author": "RodericDay", 
      "body": "<p>One of the big game journalism outfits did an hour long \"Let's Play\" with Jonathan Blow, where they showcased The Witness and talked about many of its design decisions.</p>\n\n<p>My favorite part was where Blow talks about how the puzzle idea started from an RPG-style game where you cast spells by performing gestures on-screen, where certain aspects of how you drew symbols (ie: speed, size) determined the traits of the spell cast.</p>\n\n<p>However, after exploring the idea a bit, he realized that it wasn't really much fun to do elaborate gestures when what you really wanted was to merely cast \"Fireball 1\", which you would do a thousand times in the course of the game. What was really fun was the lore-related ways in which you could teach spells to the player, by having them find them carved as runes into the scenery and such.</p>\n\n<p>So he made a game about that phenomenon of \"discovery\" instead. I thought it was brilliant insight.</p>", 
      "comments_url": "https://news.ycombinator.com/item?id=11746982", 
      "date_posted": "Sun, 22 May 2016 01:03:46 GMT", 
      "date_updated": "Sun, 22 May 2016 01:05:09 GMT", 
      "domain": null, 
      "id": 11746982, 
      "num_comments": 0, 
      "score": null, 
      "subtype": "comment", 
      "title": null, 
      "type": "comment", 
      "url": "https://news.ycombinator.com/item?id=11746982"
    }, 
    {
      "author": "DoggettCK", 
      "body": "<p>I'd be curious to see if certain locations trigger surge pricing, too. My wife and I got sideswiped about a month ago, had to go to the ER in Austin.</p>\n\n<p>Got out, had no way to get back to our truck, nor to our house an hour outside Austin. Called Uber, figuring we'd at least get a ride back to the truck to get our stuff, and see if any friends could take us the rest of the way home.</p>\n\n<p>Despite nothing going on in town that night, and only being about 8:30pm, the app warned me of surge pricing, saying it would be 1.5x the usual fare. Didn't have many other options, and had been happy with Uber in the past, so went ahead.</p>\n\n<p>Driver was cool, and not only took us back to the truck, but drove us all the way home, complete with a flat tire we helped him change on the side of a busy, dark toll road, and running out of gas.</p>\n\n<p>Wound up being $98, and that guy really earned his tip. I still wonder if the fact that we called from the exit of the ER triggered surge pricing, though. Not a great time to experiment, but I could've probably walked a few blocks and tried again, if my wife wasn't in the shape she was in at the time.</p>", 
      "comments_url": "https://news.ycombinator.com/item?id=11746981", 
      "date_posted": "Sun, 22 May 2016 01:03:33 GMT", 
      "date_updated": "Sun, 22 May 2016 01:05:09 GMT", 
      "domain": null, 
      "id": 11746981, 
      "num_comments": 0, 
      "score": null, 
      "subtype": "comment", 
      "title": null, 
      "type": "comment", 
      "url": "https://news.ycombinator.com/item?id=11746981"
    }, 
    {
      "author": "ketralnis", 
      "body": "<p>Can recommend <a href=\"https://www.reddit.com/r/buildapc\">https://www.reddit.com/r/buildapc</a>. They are pretty helpful and have pretty complete builds for most use cases. Search for threads like this one <a href=\"https://www.reddit.com/r/buildapc/comments/487fc1/building_cheap_gaming_pc/\">https://www.reddit.com/r/buildapc/comments/487fc1/building_c...</a></p>", 
      "comments_url": "https://news.ycombinator.com/item?id=11746980", 
      "date_posted": "Sun, 22 May 2016 01:03:19 GMT", 
      "date_updated": "Sun, 22 May 2016 01:05:08 GMT", 
      "domain": null, 
      "id": 11746980, 
      "num_comments": 0, 
      "score": null, 
      "subtype": "comment", 
      "title": null, 
      "type": "comment", 
      "url": "https://news.ycombinator.com/item?id=11746980"
    }, 
    {
      "author": "JulianMorrison", 
      "body": "<p>Society changes fast when a big shift like this comes along. People knew horses, they were used to them. Boom, gone, when the mass market motor car and motor tractor replaced them. Society adapted so hard that a horse went from a daily sight, to a symbol of the past.</p>\n\n<p>People will complain. Laws will be passed in backward places. Truckers will protest. Boom, gone.</p>", 
      "comments_url": "https://news.ycombinator.com/item?id=11746979", 
      "date_posted": "Sun, 22 May 2016 01:03:12 GMT", 
      "date_updated": "Sun, 22 May 2016 01:05:08 GMT", 
      "domain": null, 
      "id": 11746979, 
      "num_comments": 0, 
      "score": null, 
      "subtype": "comment", 
      "title": null, 
      "type": "comment", 
      "url": "https://news.ycombinator.com/item?id=11746979"
    }, 
    {
      "author": "webappsecperson", 
      "body": "<p>On a lark I recently trained JC Johnson's recurrent neural net (https://github.com/jcjohnson/torch-rnn) on the text of the A Song of Ice and Fire corpus.</p>\n\n<p>The results its generates are, like all neural nets, often simultaneously both incoherent and sublime. You can check it out at @grrmbot or here's a snippet</p>\n\n<p>He never saw the Lannister had run at the fire. \n“Get at once. At Wyll's sale?\" \n\"Some are lost Petyr Deata. \"Urs,\" Tyrion watched them. “This of me an oatweebear, it wouldn't yield your head,\" he \nsmokes buling back with a covered hunt. \n“The snows meant them can you come a thorse, or one, ser.” \n“Your championing Longwaters be goes well,” he \nsaid. \"The world at called me Joffrey.”</p>", 
      "comments_url": "https://news.ycombinator.com/item?id=11746977", 
      "date_posted": "Sun, 22 May 2016 01:02:21 GMT", 
      "date_updated": "Sun, 22 May 2016 01:08:05 GMT", 
      "domain": null, 
      "id": 11746977, 
      "num_comments": 0, 
      "score": 1, 
      "subtype": "show", 
      "title": "Show HN: I used a neural net to make a Twitter doppelganger for GRRM, grrmbot", 
      "type": "story", 
      "url": "https://news.ycombinator.com/item?id=11746977"
    }, 
    {
      "author": "011110111110111", 
      "body": null, 
      "comments_url": "https://news.ycombinator.com/item?id=11746976", 
      "date_posted": "Sun, 22 May 2016 01:01:52 GMT", 
      "date_updated": "Sun, 22 May 2016 01:08:05 GMT", 
      "domain": "youtube.com", 
      "id": 11746976, 
      "num_comments": 0, 
      "score": 2, 
      "subtype": "link", 
      "title": "Programming Music (House Is Deep – Track 1)", 
      "type": "story", 
      "url": "https://www.youtube.com/watch?v=Q1Jb6hPGc7I"
    }, 
    {
      "author": "nickpsecurity", 
      "body": "<p>Yeah, Itanium is IA-64. It's also dying but not forgotten: people who like RISC, reliability, security features, and high-speed all in one remember their vain attempt well. Are also reaping benefits of used HP Integrity and SGI Altix boxes on eBay selling cheaper than consoles. I'm eyeballing a few of those suckers myself. :)</p>", 
      "comments_url": "https://news.ycombinator.com/item?id=11746975", 
      "date_posted": "Sun, 22 May 2016 01:01:24 GMT", 
      "date_updated": "Sun, 22 May 2016 01:05:06 GMT", 
      "domain": null, 
      "id": 11746975, 
      "num_comments": 0, 
      "score": null, 
      "subtype": "comment", 
      "title": null, 
      "type": "comment", 
      "url": "https://news.ycombinator.com/item?id=11746975"
    }, 
    {
      "author": "dimino", 
      "body": "<p>This is a you thing.  Nerds are cool now, the battle you're trying to fight is over.</p>", 
      "comments_url": "https://news.ycombinator.com/item?id=11746974", 
      "date_posted": "Sun, 22 May 2016 01:01:21 GMT", 
      "date_updated": "Sun, 22 May 2016 01:05:05 GMT", 
      "domain": null, 
      "id": 11746974, 
      "num_comments": 0, 
      "score": null, 
      "subtype": "comment", 
      "title": null, 
      "type": "comment", 
      "url": "https://news.ycombinator.com/item?id=11746974"
    }, 
    {
      "author": "wpietri", 
      "body": "<p>Interesting! I agree entirely that Java and OO leave a lot of room for developer to go astray. And I've enjoyed my limited coding in functional languages. But is something like F# really better in practice?</p>\n\n<p>I ask because every functional-language code base I've been able to look at myself has two advantages: 1) it's not very large, and 2) it was made by very smart, experienced developers with a passion for functional languages. When I look at similarly sized OO code bases produced by people with similar levels of passion and expertise, the code base is also very good.</p>\n\n<p>The terrible Java code I've seen, on the other hand, mostly comes from less experienced people whose priorities are things like \"keep boss happy\", \"put in all required hours\", and \"comply with project plan\". Which is, sadly, the average case in the industry.</p>\n\n<p>So I'm wondering: What happens if some functional language becomes mainstream? Will junior programmers at EnormoBank's latest death march produce better software?</p>", 
      "comments_url": "https://news.ycombinator.com/item?id=11746973", 
      "date_posted": "Sun, 22 May 2016 01:01:17 GMT", 
      "date_updated": "Sun, 22 May 2016 01:05:05 GMT", 
      "domain": null, 
      "id": 11746973, 
      "num_comments": 0, 
      "score": null, 
      "subtype": "comment", 
      "title": null, 
      "type": "comment", 
      "url": "https://news.ycombinator.com/item?id=11746973"
    }, 
    {
      "author": "debh", 
      "body": "<p>Yes - it's mostly applicable when you're creating APIs and developer solutions. But even in case of internal tools/ exes, you might need to share functionality with a internal partner team and it's helpful if they don't have to read code they don't need to use.</p>", 
      "comments_url": "https://news.ycombinator.com/item?id=11746972", 
      "date_posted": "Sun, 22 May 2016 01:01:14 GMT", 
      "date_updated": "Sun, 22 May 2016 01:05:04 GMT", 
      "domain": null, 
      "id": 11746972, 
      "num_comments": 0, 
      "score": null, 
      "subtype": "comment", 
      "title": null, 
      "type": "comment", 
      "url": "https://news.ycombinator.com/item?id=11746972"
    }, 
    {
      "author": "dylz", 
      "body": "<p>What are mechanical slide things? Like you swipe instead of use chip?</p>", 
      "comments_url": "https://news.ycombinator.com/item?id=11746971", 
      "date_posted": "Sun, 22 May 2016 01:01:10 GMT", 
      "date_updated": "Sun, 22 May 2016 01:05:03 GMT", 
      "domain": null, 
      "id": 11746971, 
      "num_comments": 0, 
      "score": null, 
      "subtype": "comment", 
      "title": null, 
      "type": "comment", 
      "url": "https://news.ycombinator.com/item?id=11746971"
    }, 
    {
      "author": "marcopolis", 
      "body": null, 
      "comments_url": "https://news.ycombinator.com/item?id=11746970", 
      "date_posted": "Sun, 22 May 2016 01:01:05 GMT", 
      "date_updated": "Sun, 22 May 2016 01:08:06 GMT", 
      "domain": "nongnu.org", 
      "id": 11746970, 
      "num_comments": 0, 
      "score": 2, 
      "subtype": "link", 
      "title": "The Carbone Ruby VM", 
      "type": "story", 
      "url": "http://www.nongnu.org/carbone/"
    }, 
    {
      "author": "zappo2938", 
      "body": "<p>Why not read Rainer Maria Rilke or Charles Bukowski?</p>\n\n<p>“In the deepest hour of the night, confess to yourself that you would die if you were forbidden to write [code]. And look deep into your heart where it spreads its roots, the answer, and ask yourself, must I write [code]?” -- Rilke, Letters to a Young Poet</p>\n\n<p>Rilke apprenticed with the sculptor Rodin in Paris not learning sculpting as Rilke was a writer and poet, rather he learned how to see the world as an artist.</p>", 
      "comments_url": "https://news.ycombinator.com/item?id=11746968", 
      "date_posted": "Sun, 22 May 2016 01:00:29 GMT", 
      "date_updated": "Sun, 22 May 2016 01:01:26 GMT", 
      "domain": null, 
      "id": 11746968, 
      "num_comments": 0, 
      "score": null, 
      "subtype": "comment", 
      "title": null, 
      "type": "comment", 
      "url": "https://news.ycombinator.com/item?id=11746968"
    }, 
    {
      "author": "barkingdog", 
      "body": "<p>I doubt you are trying to harm anyone. But you're not being very helpful. You say that you've \"landed on someone's holy ground\" but there is a very low chance that is going on. They probably just want to get a job done, and they want to figure out if your tool's a good fit. In all likelihood, maybe they don't like Node. I would assume that you're aware of Autobahn's existence because you link to your library passing its test suite. Did you consider that perhaps your library could be wrapped and make Autobahn-Python's story even stronger? Think about it this way:</p>\n\n<p>You've written what potentially appears to be a promising library. Great! In fact, it seems so promising that people are trying to find the equivalent in the language of their choice. Even better! Why not encourage them to write a wrapper for your fine library in their language of choice? Not everyone uses Node, after all. Maybe that person asking for equivalents in Python would've written a binding if you told them \"Hey, you could try to do this in pure python but because of the relative performance of my library, you might want to consider writing a binding to µws.\" All it takes is a little bit more thought before you type out a response.</p>\n\n<p>I'm not telling you to censor yourself. I'm telling you to stop worrying about explaining yourself, and start thinking about being more helpful. You might have written the library, but other people are going to be the ones who use it. They're going to ask you questions, and you're going to think some of those questions are stupid. It's okay. But if you try to be helpful to them even if you think their questions are stupid, you'll spend far less time writing defensive comments on HN, and far more time watching adoption for your library grow, which I assume is something you may want.</p>\n\n<p>Best of luck!</p>", 
      "comments_url": "https://news.ycombinator.com/item?id=11746967", 
      "date_posted": "Sun, 22 May 2016 00:59:24 GMT", 
      "date_updated": "Sun, 22 May 2016 01:01:26 GMT", 
      "domain": null, 
      "id": 11746967, 
      "num_comments": 0, 
      "score": null, 
      "subtype": "comment", 
      "title": null, 
      "type": "comment", 
      "url": "https://news.ycombinator.com/item?id=11746967"
    }, 
    {
      "author": "ktamura", 
      "body": "<p>That's one part of the piece that I disagreed with as well. That said, it's true that Apple is not a AI-first/data-first company. As a result, they have less data and data culture inside the company. While these acquisitions may change their culture incrementally, it's unlikely that their company DNA catches up to Google/Facebook's.</p>\n\n<p>Culture is a powerful force in shaping products. For better and worse, Google/Facebook have the \"let's use customer data to build products\" DNA ingrained into their company DNA. Of course, this has pros and cons. At times, their thirst for customer data can be creepy/controversial while Apple's steadfast support for customer data privacy is assuring.</p>\n\n<p>Ultimately, it comes down to this: How willing are we to exchange our own behavior and demographic data for convenience? If the answer is yes, then the future is as Marco predicts it.</p>", 
      "comments_url": "https://news.ycombinator.com/item?id=11746966", 
      "date_posted": "Sun, 22 May 2016 00:58:53 GMT", 
      "date_updated": "Sun, 22 May 2016 01:01:25 GMT", 
      "domain": null, 
      "id": 11746966, 
      "num_comments": 0, 
      "score": null, 
      "subtype": "comment", 
      "title": null, 
      "type": "comment", 
      "url": "https://news.ycombinator.com/item?id=11746966"
    }, 
    {
      "author": "sneha87", 
      "body": "<p>I think 5.b is mostly applicable when you're packaging DLLs. I don't see much use for it in internal projects (Eg. If I'm building a end user solution and not developer solution).</p>", 
      "comments_url": "https://news.ycombinator.com/item?id=11746965", 
      "date_posted": "Sun, 22 May 2016 00:58:30 GMT", 
      "date_updated": "Sun, 22 May 2016 01:01:25 GMT", 
      "domain": null, 
      "id": 11746965, 
      "num_comments": 0, 
      "score": null, 
      "subtype": "comment", 
      "title": null, 
      "type": "comment", 
      "url": "https://news.ycombinator.com/item?id=11746965"
    }, 
    {
      "author": "dfc", 
      "body": "<p>I doubt wide adoption of a tool used internally is at the top of the Netflix devs priority list. It solves an internal need and it does not hurt to throw some code over the wall, so why not toss it on github and see if you can get some free labor.</p>", 
      "comments_url": "https://news.ycombinator.com/item?id=11746964", 
      "date_posted": "Sun, 22 May 2016 00:58:05 GMT", 
      "date_updated": "Sun, 22 May 2016 01:01:24 GMT", 
      "domain": null, 
      "id": 11746964, 
      "num_comments": 0, 
      "score": null, 
      "subtype": "comment", 
      "title": null, 
      "type": "comment", 
      "url": "https://news.ycombinator.com/item?id=11746964"
    }, 
    {
      "author": "newjersey", 
      "body": "<p>In my (possibly incorrect) understanding, the promise of uber to shareholders is the network effect. However, you're right. This elasticity only goes so far. If Uber is smart, they should work hard to keep prices (and profits) low as long as they can afford to do so.</p>", 
      "comments_url": "https://news.ycombinator.com/item?id=11746963", 
      "date_posted": "Sun, 22 May 2016 00:58:04 GMT", 
      "date_updated": "Sun, 22 May 2016 01:01:23 GMT", 
      "domain": null, 
      "id": 11746963, 
      "num_comments": 0, 
      "score": null, 
      "subtype": "comment", 
      "title": null, 
      "type": "comment", 
      "url": "https://news.ycombinator.com/item?id=11746963"
    }, 
    {
      "author": "nickparker", 
      "body": "<p>The common complaint against Uber is that drivers barely make any money when you factor in minimum wage.</p>\n\n<p>Their solution won't be increased prices, it'll be the end of drivers. I'd love to see someone actually run the cashflows, but the current prices seem to me about adequate for healthy profit on driverless vehicles. All this nonsense about paying drivers is just incredibly expensive market building.</p>", 
      "comments_url": "https://news.ycombinator.com/item?id=11746962", 
      "date_posted": "Sun, 22 May 2016 00:57:33 GMT", 
      "date_updated": "Sun, 22 May 2016 01:01:22 GMT", 
      "domain": null, 
      "id": 11746962, 
      "num_comments": 0, 
      "score": null, 
      "subtype": "comment", 
      "title": null, 
      "type": "comment", 
      "url": "https://news.ycombinator.com/item?id=11746962"
    }, 
    {
      "author": "kordless", 
      "body": "<p>That's not scalable when it tries to sell to everyone, however.</p>", 
      "comments_url": "https://news.ycombinator.com/item?id=11746961", 
      "date_posted": "Sun, 22 May 2016 00:56:51 GMT", 
      "date_updated": "Sun, 22 May 2016 01:01:22 GMT", 
      "domain": null, 
      "id": 11746961, 
      "num_comments": 0, 
      "score": null, 
      "subtype": "comment", 
      "title": null, 
      "type": "comment", 
      "url": "https://news.ycombinator.com/item?id=11746961"
    }, 
    {
      "author": "charlesdm", 
      "body": "<p>Do you consider building (and possibly selling) a business \"not to have earned it\"?</p>", 
      "comments_url": "https://news.ycombinator.com/item?id=11746960", 
      "date_posted": "Sun, 22 May 2016 00:56:09 GMT", 
      "date_updated": "Sun, 22 May 2016 01:01:21 GMT", 
      "domain": null, 
      "id": 11746960, 
      "num_comments": 0, 
      "score": null, 
      "subtype": "comment", 
      "title": null, 
      "type": "comment", 
      "url": "https://news.ycombinator.com/item?id=11746960"
    }, 
    {
      "author": "rsync", 
      "body": "<p>\"Charge CEO here. We can definitely disable voicemail for you.\"</p>\n\n<p>Yes, but <i>what happens</i> when you disable voicemail ?</p>\n\n<p>ATT wireless can disable vm for me, it just results in weird behavior that confuses people...</p>\n\n<p>If I disable voicemail on Charge, and am out of coverage area (or have phone turned off) what does the caller experience ?</p>", 
      "comments_url": "https://news.ycombinator.com/item?id=11746959", 
      "date_posted": "Sun, 22 May 2016 00:55:02 GMT", 
      "date_updated": "Sun, 22 May 2016 01:01:20 GMT", 
      "domain": null, 
      "id": 11746959, 
      "num_comments": 0, 
      "score": null, 
      "subtype": "comment", 
      "title": null, 
      "type": "comment", 
      "url": "https://news.ycombinator.com/item?id=11746959"
    }, 
    {
      "author": "pkaye", 
      "body": "<p>I think pension funds are prone to abuse in many ways (underfunding, unrealistic expectations, over-promise.) Best to give everyone tax deferred investment accounts where they can invest in mutual funds or something diversified for the long term.</p>", 
      "comments_url": "https://news.ycombinator.com/item?id=11746957", 
      "date_posted": "Sun, 22 May 2016 00:54:59 GMT", 
      "date_updated": "Sun, 22 May 2016 01:01:19 GMT", 
      "domain": null, 
      "id": 11746957, 
      "num_comments": 0, 
      "score": null, 
      "subtype": "comment", 
      "title": null, 
      "type": "comment", 
      "url": "https://news.ycombinator.com/item?id=11746957"
    }, 
    {
      "author": "Zigurd", 
      "body": "<p>It turns out they have nothing to do with Jibe. This is what I was able to dig up: <a href=\"http://www.telirati.com/2016/05/telirati-analysis-18-quic-brown-fox.html\">http://www.telirati.com/2016/05/telirati-analysis-18-quic-br...</a></p>", 
      "comments_url": "https://news.ycombinator.com/item?id=11746956", 
      "date_posted": "Sun, 22 May 2016 00:54:38 GMT", 
      "date_updated": "Sun, 22 May 2016 01:01:19 GMT", 
      "domain": null, 
      "id": 11746956, 
      "num_comments": 0, 
      "score": null, 
      "subtype": "comment", 
      "title": null, 
      "type": "comment", 
      "url": "https://news.ycombinator.com/item?id=11746956"
    }, 
    {
      "author": "JulianMorrison", 
      "body": "<p>Mostly, what the human would do is go \"Wha?\" THUNK.</p>\n\n<p>It's really only because AIs are <i>that fast</i>, that we even need to consider ethical scenarios at highway speed. Humans, mostly, react to things at low relative speeds (car in front brakes and you have to brake) but simply can't react to that fallen power line, crashing aircraft, etc, they'd drive right over it while their brain was still going \"oh dear\".</p>", 
      "comments_url": "https://news.ycombinator.com/item?id=11746955", 
      "date_posted": "Sun, 22 May 2016 00:54:28 GMT", 
      "date_updated": "Sun, 22 May 2016 00:55:10 GMT", 
      "domain": null, 
      "id": 11746955, 
      "num_comments": 0, 
      "score": null, 
      "subtype": "comment", 
      "title": null, 
      "type": "comment", 
      "url": "https://news.ycombinator.com/item?id=11746955"
    }, 
    {
      "author": "SapphireSun", 
      "body": "<p>Or people need to get home and if their phone dies they'll be stranded.... been there.</p>", 
      "comments_url": "https://news.ycombinator.com/item?id=11746954", 
      "date_posted": "Sun, 22 May 2016 00:54:14 GMT", 
      "date_updated": "Sun, 22 May 2016 00:55:09 GMT", 
      "domain": null, 
      "id": 11746954, 
      "num_comments": 0, 
      "score": null, 
      "subtype": "comment", 
      "title": null, 
      "type": "comment", 
      "url": "https://news.ycombinator.com/item?id=11746954"
    }, 
    {
      "author": "vikram_12", 
      "body": "<p>Excellent article. I feel there is a gap of good C++ physical layout guidelines.</p>\n\n<p>You might also want to look at : <a href=\"https://github.com/isocpp/CppCoreGuidelines/blob/master/CppCoreGuidelines.md\">https://github.com/isocpp/CppCoreGuidelines/blob/master/CppC...</a></p>", 
      "comments_url": "https://news.ycombinator.com/item?id=11746953", 
      "date_posted": "Sun, 22 May 2016 00:54:14 GMT", 
      "date_updated": "Sun, 22 May 2016 00:55:09 GMT", 
      "domain": null, 
      "id": 11746953, 
      "num_comments": 0, 
      "score": null, 
      "subtype": "comment", 
      "title": null, 
      "type": "comment", 
      "url": "https://news.ycombinator.com/item?id=11746953"
    }, 
    {
      "author": "PhantomGremlin", 
      "body": "<p><i>You'd share a toilet with several other flats</i></p>\n\n<p>This was still quite common in the 1960's in the East Village. I wonder if those buildings have been renovated since, or if those conditions still exist today?</p>", 
      "comments_url": "https://news.ycombinator.com/item?id=11746952", 
      "date_posted": "Sun, 22 May 2016 00:54:14 GMT", 
      "date_updated": "Sun, 22 May 2016 00:55:08 GMT", 
      "domain": null, 
      "id": 11746952, 
      "num_comments": 0, 
      "score": null, 
      "subtype": "comment", 
      "title": null, 
      "type": "comment", 
      "url": "https://news.ycombinator.com/item?id=11746952"
    }, 
    {
      "author": "andrewpi", 
      "body": "<p>The $30 plan doesn't come with free international roaming.</p>", 
      "comments_url": "https://news.ycombinator.com/item?id=11746951", 
      "date_posted": "Sun, 22 May 2016 00:54:05 GMT", 
      "date_updated": "Sun, 22 May 2016 00:55:08 GMT", 
      "domain": null, 
      "id": 11746951, 
      "num_comments": 0, 
      "score": null, 
      "subtype": "comment", 
      "title": null, 
      "type": "comment", 
      "url": "https://news.ycombinator.com/item?id=11746951"
    }, 
    {
      "author": "mattbee", 
      "body": "<p>If you're in the UK, Andrews &amp; Arnold have been providing \"nerd SIMs\" with proper networking and configurable voice services for years.  Not that they're easy to configure or cheap :) but -&gt; <a href=\"http://aaisp.net/telecoms-sip2sim.html\">http://aaisp.net/telecoms-sip2sim.html</a></p>", 
      "comments_url": "https://news.ycombinator.com/item?id=11746950", 
      "date_posted": "Sun, 22 May 2016 00:53:51 GMT", 
      "date_updated": "Sun, 22 May 2016 00:55:07 GMT", 
      "domain": null, 
      "id": 11746950, 
      "num_comments": 0, 
      "score": null, 
      "subtype": "comment", 
      "title": null, 
      "type": "comment", 
      "url": "https://news.ycombinator.com/item?id=11746950"
    }
  ], 
  "query": ""
}
